[Killed] Equality mutation
workspace/Solution/Palindrome/Palindrome.cs:9:33
         {
             // Exit early for trivial cases, such as null,
             // empty string, and a word with a single letter
-            if (word == null || word.Length < 2)
+            if (word == null || word.Length <= 2)
             {
                 return true;
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionNegative

[Killed] Equality mutation
workspace/Solution/Palindrome/Palindrome.cs:17:21
             var firstChar = word[0];
             var lastChar = word[^1];
             var center = word[1..^1];
-            return (firstChar == lastChar) && IsPalindrome(center);
+            return (firstChar != lastChar) && IsPalindrome(center);
         }
     }
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionHappy; us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionNegative; us.fatehi.palindrome.test.PalindromeTest.HappyPathEvenLetters

[Killed] Logical mutation
workspace/Solution/Palindrome/Palindrome.cs:17:20
             var firstChar = word[0];
             var lastChar = word[^1];
             var center = word[1..^1];
-            return (firstChar == lastChar) && IsPalindrome(center);
+            return (firstChar == lastChar) || IsPalindrome(center);
         }
     }
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionNegative; us.fatehi.palindrome.test.MorePalindromeTest.AlmostPalindrome; us.fatehi.palindrome.test.PalindromeTest.NegativeCase
